         --- System Configuration Dialog ---


Would you like to enter the initial configuration dialog? [yes/no]: no




Press RETURN to get started!






Router>en				
//ENABLES PRIVILEGED MODE																				
Router#conf
Router#configure t
Router#configure terminal 
// ROUTER CONFIGURATION
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#host
Router(config)#hostname R1
//CHANGE HOSTNAME
R1(config)#inte
R1(config)#interface g
R1(config)#interface gigabitEthernet 0/0/0
//SET THE INTERFACE
R1(config-if)#no shu
R1(config-if)#no shutdown 
//CHANGES THE STATE OF THE ROUTER


R1(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up


R1(config-if)#ip
R1(config-if)#ip a
R1(config-if)#ip add
R1(config-if)#ip address ?
  A.B.C.D  IP address
  dhcp     IP Address negotiated via DHCP
R1(config-if)#ip address 10.1.1.1 255.255.255.0
//SETS THE IP CONFIGURATION
R1(config-if)#end
//BACK TO PRIVILEGED MODE
R1#
%SYS-5-CONFIG_I: Configured from console by console


R1#ping 10.1.1.1


Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.1.1, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)


R1#
%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up
ping 10.1.1.1
//PING TO TEST THE CONNECTION OF THE ROUTER TO THE SWITCH


Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 0/2/5 ms


R1#
